tutorials/CFD/22FSI_ok/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(1.00039 -0.000290309 0)
(1.00039 -0.000869958 0)
(1.00039 -0.00144498 0)
(1.00038 -0.0020104 0)
(1.00037 -0.00256129 0)
(1.00035 -0.00309148 0)
(1.00033 -0.00359291 0)
(1.0003 -0.00405547 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            movingWallVelocity;
        value           nonuniform List<vector> 
318
(
(0.212302 0.036732 0)
(0.213596 0.0327405 5.62422e-20)
(0.212956 -0.0326424 -2.77562e-15)
(0.211584 -0.0366078 0)
(0.0517683 -0.0917842 2.77556e-15)
(0.0571221 0.0970224 2.77556e-15)
(0.210124 -0.0403622 5.55097e-15)
(0.0552542 -0.0938498 2.77556e-15)
...
)
;
    }
}


// ************************************************************************* //
